Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РС_ОКВЭД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РС_ДополнительныеОКВЭД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодОКВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКВЭД2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторОКВЭД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура РС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаКолонок_НГ1 = Элементы.Вставить("ГруппаДополнительныеОКВЭД", Тип("ГруппаФормы"),, );
	ГруппаКолонок_НГ1.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКолонок_НГ1.Заголовок 			= "Дополнительные ОКВЭДы";
	ГруппаКолонок_НГ1.Поведение 			= ПоведениеОбычнойГруппы.Свертываемая; 
	ГруппаКолонок_НГ1.ШрифтЗаголовка 		= Новый Шрифт(, 10);
	ГруппаКолонок_НГ1.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка; 
	ГруппаКолонок_НГ1.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаКолонок_НГ1.Скрыть();
	
	ПолеВвода_РС = Элементы.Добавить("РС_ОКВЭД2", Тип("ПолеФормы"), Элементы.ГруппаДополнительныеОКВЭД);
	ПолеВвода_РС.Заголовок = "Основной ОКВЭД2";
	ПолеВвода_РС.Вид = ВидПоляФормы.ПолеВвода;	
	ПолеВвода_РС.ПутьКДанным = "Объект.РС_ОКВЭД2";

	//Таблица  оквэдов
    ТаблицаОКВЭД = Элементы.Добавить("ДополнительныеОКВЭД", Тип("ТаблицаФормы"), ГруппаКолонок_НГ1);
	ТаблицаОКВЭД.ПутьКДанным = "Объект.РС_ДополнительныеОКВЭД";
	ТаблицаОКВЭД.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	
	ЭлементТаблицыФормы = Элементы.Добавить("ОКВЭДНомерСтроки", Тип("ПолеФормы"), ТаблицаОКВЭД);
	ЭлементТаблицыФормы.Заголовок 	= "N";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РС_ДополнительныеОКВЭД.НомерСтроки";

	ЭлементТаблицыФормы = Элементы.Добавить("ОКВЭДКодОКВЭД", Тип("ПолеФормы"), ТаблицаОКВЭД);
	ЭлементТаблицыФормы.Заголовок 	= "Код ОКВЭД";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РС_ДополнительныеОКВЭД.КодОКВЭД"; 
	
	ЭлементТаблицыФормы = Элементы.Добавить("ОКВЭДНаименованиеПолное", Тип("ПолеФормы"), ТаблицаОКВЭД);
	ЭлементТаблицыФормы.Заголовок 	= "Наименование";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РС_ДополнительныеОКВЭД.НаименованиеПолное";
	
	ЭлементТаблицыФормы = Элементы.Добавить("ОКВЭДОКВЭД2", Тип("ПолеФормы"), ТаблицаОКВЭД);
	ЭлементТаблицыФормы.Заголовок 	= "ОКВЭД 2";
	ЭлементТаблицыФормы.Вид 		= ВидПоляФормы.ПолеВвода;
	ЭлементТаблицыФормы.ПутьКДанным = "Объект.РС_ДополнительныеОКВЭД.ОКВЭД2";

	КомандаФормы = Команды.Добавить("ЗаполнитьДополнительныеОКВЭД");
	КомандаФормы.Заголовок = "Дополнительные ОКВЭДы";
	КомандаФормы.Действие  = "ЗаполнитьДополнительныеОКВЭД";

	КнопкаФормы = Элементы.Добавить("КнопкаЗаполнитьДополнительныеОКВЭД", Тип("КнопкаФормы"), Элементы.ДополнительныеОКВЭД.КоманднаяПанель);
	КнопкаФормы.ИмяКоманды = "ЗаполнитьДополнительныеОКВЭД";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеОКВЭД(Команда)
	  
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ИНН"							,Объект.ИНН);
	ПараметрыОтчета.Вставить("ИдентификаторФормы"			,"");
	ПараметрыОтчета.Вставить("Контрагент"					,Объект.Ссылка);
	ПараметрыОтчета.Вставить("СостояниеОтчета"				,"");
	ПараметрыОтчета.Вставить("СостояниеПроверки"			,"");
	ПараметрыОтчета.Вставить("СостояниеСобытияМониторинга"	,"");   
	ПараметрыОтчета.Вставить("СостояниеФакторыРиска"		,"");

	РС_ОбщийМодульСервер.ПроверкаКонтрагентовНаСервере(ПараметрыОтчета);

	Прочитать();	  
КонецПроцедуры
